packages/backend/tests/performance/scenarios/single-endpoint-multi-connection.yml
# Artillery 性能测试配置
# 场景 1: 单端点多连接测试
# 测试单个端点在不同并发连接数下的性能表现

config:
  target: "ws://localhost:3001"
  # 测试阶段配置
  phases:
    # 预热阶段: 逐渐建立连接
    - duration: 60
      arrivalRate: 2
      name: "预热阶段 - 建立初始连接"

    # 阶段 1: 10 个并发连接
    - duration: 120
      arrivalRate: 10
      name: "负载测试 - 10 并发连接"
      maxVusers: 10

    # 阶段 2: 20 个并发连接
    - duration: 120
      arrivalRate: 20
      name: "负载测试 - 20 并发连接"
      maxVusers: 20

    # 阶段 3: 50 个并发连接
    - duration: 120
      arrivalRate: 50
      name: "负载测试 - 50 并发连接"
      maxVusers: 50

  # WebSocket 引擎配置
  engines:
    ws:
      timeout: 10000 # 连接超时 10秒
      rejectUnauthorized: false # 允许自签名证书

  # 性能指标配置
  ensure:
    maxErrorRate: 1 # 最大错误率 1%
    p99: 200 # p99 延迟小于 200ms

  # Artillery 插件
  plugins:
    metrics-by-endpoint:
      # 按端点统计指标
      stripQueryString: false

# 测试场景定义
scenarios:
  - name: "单端点多连接 - WebSocket 消息收发"
    engine: ws
    flow:
      # 步骤 1: 建立 WebSocket 连接
      - connect:
          url: "ws://localhost:3001/ws/perf-test-endpoint-1"

      # 步骤 2: 等待连接建立
      - think: 1

      # 步骤 3: 发送消息 (持续 2 分钟,每秒 1 条)
      - loop:
          - send:
              payload: '{"type":"message","data":"Performance test message","timestamp":"{{ $timestamp }}"}'
          - think: 1
        count: 120

      # 步骤 4: 关闭连接前等待
      - think: 2